<?PHP

/*
 * Copyright (C) 2013 Vinodh Rajan vinodh@virtualvinodh.com
 *
 * This file is a part
 * of Avalokitam. Avalokitam is free software: you can redistribute it and/or
 * modify it under the terms of the GNU Affero General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or (at your
 * option) any later version. This program is distributed in the hope that it
 * will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty
 * of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU Affero General
 * Public License for more details. You should have received a copy of the GNU
 * Affero General Public License along with this program. If not, see
 * <http://www.gnu.org/licenses/>.
 */

require_once "menu.php";

?>

<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<title>Tamil Prosody Analyzer</title>
<?PHP echo $jscss; ?>
</head>
<body>

<?PHP echo $head?>

<?PHP echo $menu?>

<div class="container-cont">

		<h1>உதவி</h1>
		<div>ஒரு செய்யுளை
			உள்ளிட்டால், அவலோகிதம்
			அதன் சம்பந்தமான
			கீழ்க்கண்ட யாப்பு
			உறுப்புகளை வெளியிடும்:</div>
		<ul>
			<li>சீர்</li>
			<li>வாய்ப்பாடு</li>
			<li>தளை</li>
			<li>அடி</li>
			<li>தொடை</li>
			<li>பா வகை</li>
		</ul>
		<div>இந்த மென்பொருள், வெண்பா,
			ஆசிரியப்பா, கலிப்பா,
			வஞ்சிப்பா முதலிய
			நால்வகைப்பாக்களையும்
			அதற்குரிய
			பாவினங்களையும்
			கண்டுகொள்ளும் திறன்
			கொண்டது&nbsp;&nbsp;</div>
		<h2>செய்யுள் இட வேண்டிய
			வழிமுறைகள்</h2>
		<ul>
			<li>உள்ளிடப்படும் செய்யும்
				சரியான விதத்தில் சீர்
				பிரிக்கப்பட்ட செய்யுளாக
				இருக்க வேண்டும்</li>
			<li>சந்தி பிரித்த
				செய்யுள்களை இட்டால்,
				யாப்பு விதிகள் (தளை, சீர்
				முதலியன) மீறப்பட்டு
				பா-வகை தவறுதலாக வரும்.
				ஆகவே, அவற்றை
				தவிர்க்கவும்</li>
			<li>ஆதலால், சந்திபிரிக்காத
				செய்யுளையே உள்ளிடவும்</li>
			<li>அலகிடக்கூடாத எழுத்தை
				அடைப்புக்குறிக்குள்
				இடவும்</li>
			<li>நெடிலடிகளையும்
				கழிநெடிலடிகளையும் ஒரே
				வரியாக இடவும். (பொதுவாக,
				அச்சிடும் போது அவற்றை
				உடைத்து இரு அடிகளாக
				இடுவது வழக்கம்)</li>
			<li>தனிச்சொல்லை - என்ற குறி
				மூலம் சுட்ட வேண்டும்&nbsp;</li>
			<li>- தவிர்த்த பிற
				நிறுத்தற்குறிகளை இடுவதை
				முடிந்த வரை தவிர்க்கவும்</li>
			<li>தேவையற்ற “இடைவெளி”
				முதலியவற்றை
				தவிர்க்கவும்&nbsp;</li>
		</ul>

		<h2>கூடுதல் தேர்வுகள்</h2>
		<h3>உயிர்முன்
			குற்றியலுகரத்தை
			அலகிடாது விடுதல்</h3>

		<p>பல சயமங்களில்,
			உயிரெழுத்துக்களுக்கு
			முன் வரும்
			குற்றியலுகரத்தை
			ஒற்றெழுத்தாக கருதி
			அலகிடாது விடுதல்
			வேண்டும். இவ்வாறு
			செய்தால் மட்டுமே
			வெண்பாவில் தளை தட்டாது.
			இதை செயல்படுத்த
			இத்தேர்வை
			தேர்ந்தெடுக்கவும்.</p>

		<h3>வெண்பா விதிகளோடு
			ஒப்பிடுதல்</h3>

		<p>தங்களுடைய பாவினை வெண்பா
			விதிகளோடு ஒப்பிட்டு அதன்
			முடிவுகளை வெளியிடும்.</p>

		<h2>அடிக்கடி
			கேட்கப்படக்கூடிய :)
			கேள்விகள்</h2>
		<ol>
			<li><strong>செய்யுளின் பாவகை
					தவறுதலாக
					காட்டப்படுகிறது.
					உதாரணமாக, நான் இட்ட
					வெண்பா வெண்டுறையாக
					வருகிறது. ஏன் ?</strong></li>
			<br />
			<div>வெண்பாவின் யாப்பு
				விதிகள்(வெண்டளை, சீர்
				வாய்ப்பாடு, ஈற்றசை
				வாய்ப்பாடு) முதலியவை
				அனைத்தும் பொருந்தி
				வருகிறதா
				எனப்பார்க்கவும்.
				வெண்பாவிற்குரிய யாப்பு
				விதிகள் மீறப்படும்
				நிலையில், அதற்கு
				நெருங்கிய வெண்பாவின்
				இனமாகிய வெண்டுறை
				பொருத்தி அதுவே
				காட்டப்படும்.&nbsp;</div>
			<div>&nbsp;</div>
			<div>
				<em>ஒரு பா வகையின் யாப்பு
					விதிகள் மீறப்பட்டால்,
					அதற்கு நெருங்கிய
					பாவினம்
					பொருத்தப்படும்.&nbsp;</em>
			</div>
			<div>&nbsp;</div>
			<li><strong>புற நடைகளை எவ்வாறு
					கையாளுவது ?</strong></li>
			<br />
			<div>சில இடங்களில்
				குறிப்பிட்ட பா வகையினை
				பொருத்துவதற்காக, சில
				விதிவிலக்குகள் உள்ளன.
				அவையே புறநடை. இதன்படி,
				பொதுவாக ஒற்றெழுத்தாக
				கருதப்படும் ஆய்தம், சில
				இடங்களில் குற்றெழுத்தாக
				கருதப்படும். அதே போல,
				உயிரளபெடை நெட்டெழுத்தாக
				கருதப்படும். சில
				இடங்களில் குற்றியலுகரம்
				அலகிடாது விடப்படும்.&nbsp;</div>
			<div>&nbsp;</div>
			<div>இவை அனைத்தும் தளை
				தட்டாமல் இருக்கவும், ஒரு
				குறிப்பிட்ட பா வகையினை
				பொருத்தவும்
				செய்யப்படும் அந்த சமயம்
				மட்டும்செயல்படுத்தப்படும்
				விதிவிலக்குகள். இவை
				யாவும் பொதுவாக விதிகள்
				கிடையாது. ஆகவே,
				இப்போதைக்கு அவை
				செயல்படுத்தப்படவில்லை.&nbsp;</div>
			<div>&nbsp;</div>
			<div>
				<em>ஆகவே, கீழ்க்கண்ட மாற்று
					வழிகளை கையாண்டு, பா வகை
					அலகிடுதலை மாற்றலாம்.
					ஆய்தத்தை குற்றெழுத்தாக
					கையாள, ஃ’வை கு’வுடன்
					பிரதீயீடு
					செய்யலாம்.உயிரளபெடையில்
					உள்ள அளபெடுத்த
					உயிரெழுத்தை நீக்கலாம்.
					அலகிடக்கூடாத எழுத்தை
					அடைப்புக்குறிக்குள்
					இடலாம்.</em>
			</div>
			<div></div>
			<div>&nbsp;</div>
			<li><strong>நம் விருப்பப்படி
					அலகிடுவது எப்படி ?</strong></li>
			<div>
				<strong>&nbsp;</strong>
			</div>
			<div>சில நேரங்களில்
				ஒன்றுக்கும் மேற்பட்ட
				முறையில் அலகிடுதல்
				சாத்தியம் ஆகும்.</div>
			<div>&nbsp;</div>
			<div>அந்நிலையில்,
				குறிப்பிட்ட விதத்திலான
				அலகிடுதலை செயல்படுத்த, /
				குறியை இட்டு, அசை பிரித்த
				சொல்லாக உள்ளீடு
				கொடுக்கவும்.</div>
			<div></div>
			<div>&nbsp;</div>
			<div>உதாரணமாக: கலை/யோ/டு
				என்றவாறு.</div>
			<div>&nbsp;</div>
		</ol>

		<a id="API"><h2>ஏ.பி.ஐ</h2></a>
		<p>
			இம்மென்பொருளுக்கு
			ரெஸ்ட் ஏ.பி.ஐயும் உள்ளது. <a
				href="http://www.avalokitam.com/api">http://www.avalokitam.api/api</a>
			என்ற வலைத்தள முகவரிக்கு
			கீழ்க்கண்ட
			பாரமீட்டர்களுடன் ஒரு
			போஸ்ட் ரிக்வெஸ்ட்
			செய்தால், ஓர்
			எக்ஸ்.எம்.எல் கோப்பு
			திருப்பி அனுப்பப்படும்.
		</p>

		<p>
			<em>verse</em> : உரை தமிழ்
			யூனிகோடில் <br /> <em>lang</em> :
			வெளியீட்டின் மொழி. 'en'
			அல்லது 'ta' வாக இருத்தல்
			வேண்டும். இயல்பிருப்பு 'ta' <br />
			<em>kurilu</em> : உயிர்முன்
			குற்றியலுகரத்தை
			அலகிடாது விடுதல். 1 அல்லது
			0. இயல்பிருப்பு 0
		</p>

		<a id="terminal"><h2>டெர்மினல்</h2></a>
		<p>
			நீங்கள் இம்மென்பொருளை
			தங்கள் டெர்மினலில்
			இருந்தும் இயக்கலாம். மூல
			சோர்ஸ் கோட்'ஐ <a
				href="https://github.com/virtualvinodh/avalokitam">கிட்ஹப்பிலிருந்து</a>
			டவுன்லோட் செய்யவும்.
			பிறகு பி.ஹெச்.பி சி.எல்.ஐ
			மூலம் அதை
			செயல்படுத்தவும்.
		</p>
		<p>ஓஎஸ் எக்ஸ்'ல்
			இயல்பிருப்பாக வரும்
			பி.ஹெச்.பியில் யூனிகோட்
			ஆதரவு முறையாக இல்லை. எனவே
			ஹோம்ப்ரூவின் மூலம்
			பி.ஹெச்.பி 5.4'ஐ இன்ஸ்டால்
			செய்யவும்.</p>

		<image src="css/images/options.png" />
		<image src="css/images/sample-analysis-ta.png" />
		<br/>
		பொதுவாக டெர்மினலில்
		யூனிகோட் தமிழ் முறையாக
		இருக்காது. எனவே,
		வெளியீட்டை கோப்பில்
		சேமிக்காத பட்சத்தில்
		ஆங்கில வெளியீட்டை
		பயன்படுத்தலாம். <br/>

	</div>

<?PHP echo $foot ?>

